In [1]:
import pandas as pd
import numpy as np

In [4]:
books = pd.read_csv('/home/ragnar/Documents/data_sets/BX_Books.csv',sep=";", error_bad_lines=False, encoding='latin-1')

/home/ragnar/anaconda3/lib/python3.9/site-packages/IPython/core/interactiveshell.py:3444: FutureWarning: The error_bad_lines argument has been deprecated and will be removed in a future version.


  exec(code_obj, self.user_global_ns, self.user_ns)

In [6]:
books.columns

Index(['ISBN', 'Book-Title', 'Book-Author', 'Year-Of-Publication', 'Publisher',
       'Image-URL-S', 'Image-URL-M', 'Image-URL-L'],
      dtype='object')

In [7]:
books = books[['ISBN','Book-Title','Book-Author','Year-Of-Publication','Publisher']]

In [8]:
books.head(2)

,ISBN,Book-Title,Book-Author,Year-Of-Publication,Publisher
0,0195153448,Classical Mythology,Mark P. O. Morford,2002,Oxford University Press
1,0002005018,Clara Callan,Richard Bruce Wright,2001,HarperFlamingo Canada

In [11]:
books = books.rename(columns={'Book-Title':'title', 'Book-Author':'author','Year-Of-Publication':'year','Publisher':'publisher'})

In [12]:
books.head(2)

,ISBN,title,author,year,publisher
0,0195153448,Classical Mythology,Mark P. O. Morford,2002,Oxford University Press
1,0002005018,Clara Callan,Richard Bruce Wright,2001,HarperFlamingo Canada

In [13]:
users = pd.read_csv('/home/ragnar/Documents/data_sets/BX-Users.csv',sep=';', error_bad_lines=False, encoding='latin-1')

/home/ragnar/anaconda3/lib/python3.9/site-packages/IPython/core/interactiveshell.py:3444: FutureWarning: The error_bad_lines argument has been deprecated and will be removed in a future version.


  exec(code_obj, self.user_global_ns, self.user_ns)

In [14]:
users.head(2)

   User-ID                   Location   Age
0        1         nyc, new york, usa   NaN
1        2  stockton, california, usa  18.0

In [15]:
users.rename(columns={'User_ID':'user_id','Location':'location','Age':'age'},inplace=True)

In [16]:
users.head(3)

   User-ID                         location   age
0        1               nyc, new york, usa   NaN
1        2        stockton, california, usa  18.0
2        3  moscow, yukon territory, russia   NaN

In [18]:
users.rename(columns={'User-ID':'user_id'},inplace=True)

In [19]:
users.sample(2)

       user_id                   location   age
80221    80222  valencia, valencia, spain  26.0
42105    42106  san jose, california, usa   NaN

In [20]:
ratings = pd.read_csv('/home/ragnar/Documents/data_sets/BX-Book-Ratings.csv', sep=';',error_bad_lines=False, encoding='latin-1')

/home/ragnar/anaconda3/lib/python3.9/site-packages/IPython/core/interactiveshell.py:3444: FutureWarning: The error_bad_lines argument has been deprecated and will be removed in a future version.


  exec(code_obj, self.user_global_ns, self.user_ns)

In [21]:
ratings.head(2)

   User-ID        ISBN  Book-Rating
0   276725  034545104X            0
1   276726  0155061224            5

In [22]:
ratings.rename(columns={'User-ID':'user_id', 'Book-Rating':'rating'},inplace=True)

In [23]:
ratings.head(2)

   user_id        ISBN  rating
0   276725  034545104X       0
1   276726  0155061224       5

In [24]:
books.shape

(271379, 5)

In [25]:
users.shape

(278858, 3)

In [26]:
ratings.shape

(1149780, 3)

In [32]:
x = ratings['user_id'].value_counts() > 200

In [33]:
y = x[x].index

In [34]:
y

Int64Index([ 11676, 198711, 153662,  98391,  35859, 212898, 278418,  76352,
            110973, 235105,
            ...
            260183,  73681,  44296, 155916,   9856, 274808,  28634,  59727,
            268622, 188951],
           dtype='int64', length=899)

In [35]:
ratings = ratings[ratings['user_id'].isin(y)]

In [36]:
ratings.shape

(526356, 3)

In [37]:
ratings_with_books = ratings.merge(books, on='ISBN')

In [38]:
ratings_with_books.shape

(487685, 7)

In [40]:
number_rating = ratings_with_books.groupby('title')['rating'].count().reset_index()

In [42]:
number_rating.rename(columns={'rating':'number of ratings'},inplace = True)

In [44]:
final_rating = ratings_with_books.merge(number_rating, on='title')

In [45]:
final_rating.head()

,user_id,ISBN,rating,title,author,year,publisher,number of ratings
0,277427,002542730X,10,Politically Correct Bedtime Stories: Modern Ta...,James Finn Garner,1994,John Wiley & Sons Inc,82
1,3363,002542730X,0,Politically Correct Bedtime Stories: Modern Ta...,James Finn Garner,1994,John Wiley & Sons Inc,82
2,11676,002542730X,6,Politically Correct Bedtime Stories: Modern Ta...,James Finn Garner,1994,John Wiley & Sons Inc,82
3,12538,002542730X,10,Politically Correct Bedtime Stories: Modern Ta...,James Finn Garner,1994,John Wiley & Sons Inc,82
4,13552,002542730X,0,Politically Correct Bedtime Stories: Modern Ta...,James Finn Garner,1994,John Wiley & Sons Inc,82

In [46]:
final_rating = final_rating[final_rating['number of ratings'] >=50]

In [47]:
final_rating.shape

(61853, 8)

In [48]:
final_rating.drop_duplicates(['user_id','title'],inplace=True)

In [49]:
final_rating.shape

(59850, 8)

In [50]:
book_pivot = final_rating.pivot_table(columns='user_id',index='title',values='rating')

In [52]:
book_pivot.shape

(742, 888)

In [53]:
book_pivot.fillna(0,inplace=True)

In [54]:
book_pivot.head(2)

user_id,254,2276,2766,2977,3363,3757,4017,4385,6242,6251,...,274004,274061,274301,274308,274808,275970,277427,277478,277639,278418
title,,,,,,,,,,,,,,,,,,,,,
1984,9.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
1st to Die: A Novel,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0

In [55]:
from scipy.sparse import csr_matrix
book_sparse = csr_matrix(book_pivot)

In [56]:
type(book_sparse)

scipy.sparse.csr.csr_matrix

In [57]:
from sklearn.neighbors import NearestNeighbors

In [58]:
model = NearestNeighbors(algorithm='brute')

In [59]:
model.fit(book_sparse)

NearestNeighbors(algorithm='brute')

In [ ]:
distances, suggestions = model.kneighbors(book_pivot.iloc[237,:].values.reshape(1,-1))